# Pandas exercise projects for learning and practicing pandas. 
Pandas is an open-source, BSD-licensed Python library. Pandas is a handy and useful data-structure tool for analyzing large and complex data. Practice DataFrame, Data Selection, Group-By, Series, Sorting,

# 1. SF Salaries Exercise

### Import pandas as pd

In [6]:
import pandas as pd

### Read Salaries.csv as a dataframe called sal.

In [8]:
#https://www.kaggle.com/datasets/kaggle/sf-salaries
# using the SF Salaries Dataset from Kaggle!
sal =pd.read_csv('Salaries.csv')

### Check the headings of the DataFrame.

In [10]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

### how many entries there are?

In [11]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

### What is the average TotalPay?

In [16]:
sal['TotalPay'].mean()

74768.321971703

### What is the highest amount of OvertimePay in the dataset ?

In [17]:
sal['OvertimePay'].max()

245131.88

### What is the job title of ALBERT PARDINL ?

In [22]:
sal['EmployeeName'] == 'ALBERT PARDINI'

0         False
1         False
2          True
3         False
4         False
          ...
148649    False
148650    False
148651    False
148652    False
148653    False
Name: EmployeeName, Length: 148654, dtype: bool

In [23]:
sal[sal['EmployeeName'] == 'ALBERT PARDINI']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN

In [25]:
sal[sal['EmployeeName'] == 'ALBERT PARDINI']['JobTitle']

2    CAPTAIN III (POLICE DEPARTMENT)
Name: JobTitle, dtype: object

### How much does PATRICK GARDNER make (including benefits)?

In [26]:
sal[sal['EmployeeName'] == 'PATRICK GARDNER']['TotalPayBenefits']

4    326373.19
Name: TotalPayBenefits, dtype: float64

### What is the name of highest paid person (including benefits)?

In [27]:
sal['TotalPayBenefits']

0         567595.43
1         538909.28
2         335279.91
3         332343.61
4         326373.19
            ...
148649         0.00
148650         0.00
148651         0.00
148652         0.00
148653      -618.13
Name: TotalPayBenefits, Length: 148654, dtype: float64

In [33]:
sal['TotalPayBenefits'] == sal['TotalPayBenefits'].max()

0          True
1         False
2         False
3         False
4         False
          ...
148649    False
148650    False
148651    False
148652    False
148653    False
Name: TotalPayBenefits, Length: 148654, dtype: bool

In [35]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

### What is the name of lowest paid person (including benefits)?

In [37]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

### What was the average (mean) BasePay of all employees per year? (2011-2014)

In [39]:
sal.groupby('Year').mean()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Notes,Status
Year,,,,,,,,,
2011,18080.0,63595.956517,4531.065429,3617.081926,NaN,71744.103871,71744.103871,NaN,NaN
2012,54542.5,65436.406857,5023.417824,3653.437583,26439.966967,74113.262265,100553.229232,NaN,NaN
2013,91728.5,69630.030216,5281.641980,3819.969007,23829.076572,77611.443142,101440.519714,NaN,NaN
2014,129593.0,66564.421924,5401.993737,3505.421251,24789.601756,75463.918140,100250.918884,NaN,NaN

In [40]:
sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

### How many unique job titles are there?

In [41]:
sal['JobTitle'].nunique()

2159

What are the top 10 most common jobs?

In [42]:
sal['JobTitle'].value_counts().head(10)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Custodian                       2418
TRANSIT OPERATOR                2388
Firefighter                     2359
Recreation Leader               1971
Patient Care Assistant          1945
Name: JobTitle, dtype: int64

### How many people have the word Nurse in their job title?

In [52]:
def nurse_string(title):
    if 'nurse' in title.lower():
        return True
    else:
        return False

In [54]:
sum(sal['JobTitle'].apply(lambda x: nurse_string(x)))

13377

### Is there a correlation between length of the Job Title string and Salary?

In [61]:
sal['title_len'] = sal['JobTitle'].apply(len)

In [63]:
sal[['JobTitle', 'title_length']]

                                              JobTitle  title_length
0       GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY            46
1                      CAPTAIN III (POLICE DEPARTMENT)            31
2                      CAPTAIN III (POLICE DEPARTMENT)            31
3                 WIRE ROPE CABLE MAINTENANCE MECHANIC            36
4         DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)            44
...                                                ...           ...
148649                                       Custodian             9
148650                                    Not provided            12
148651                                    Not provided            12
148652                                    Not provided            12
148653                      Counselor, Log Cabin Ranch            26

[148654 rows x 2 columns]

In [65]:
sal[['JobTitle', 'title_length']].corr() #no correlation

              title_length
title_length           1.0

# 2. Ecommerce Purchases Exercise
data source https://www.kaggle.com/datasets/vladmarascu/ecommerce-purchases-csv

In [66]:
ecom = pd.read_csv('Ecommerce Purchases')

### Check the head of the DataFrame

In [67]:
ecom.head()

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

### How many rows and columns are there?

In [68]:
ecom.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Address           10000 non-null  object
 1   Lot               10000 non-null  object
 2   AM or PM          10000 non-null  object
 3   Browser Info      10000 non-null  object
 4   Company           10000 non-null  object
 5   Credit Card       10000 non-null  int64
 6   CC Exp Date       10000 non-null  object
 7   CC Security Code  10000 non-null  int64
 8   CC Provider       10000 non-null  object
 9   Email             10000 non-null  object
 10  Job               10000 non-null  object
 11  IP Address        10000 non-null  object
 12  Language          10000 non-null  object
 13  Purchase Price    10000 non-null  float64
dtypes: float64(1), int64(2), object(11)
memory usage: 1.1+ MB

### What is the average Purchase Price?

In [69]:
ecom['Purchase Price'].mean()

50.34730200000025

### What were the highest and lowest purchase prices?

In [70]:
ecom['Purchase Price'].max()

99.99

In [71]:
ecom['Purchase Price'].min()

0.0

### How many people have German 'de' as their Language of choice on the website?

In [74]:
ecom['Language']=='en'

0       False
1       False
2       False
3       False
4       False
        ...
9995    False
9996    False
9997    False
9998    False
9999    False
Name: Language, Length: 10000, dtype: bool

In [77]:
ecom[ecom['Language']=='de'].count()

Address             1155
Lot                 1155
AM or PM            1155
Browser Info        1155
Company             1155
Credit Card         1155
CC Exp Date         1155
CC Security Code    1155
CC Provider         1155
Email               1155
Job                 1155
IP Address          1155
Language            1155
Purchase Price      1155
dtype: int64

### How many people have the job title of "Scientist" ?

In [80]:
ecom[ecom['Job'] == 'Lawyer'].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30 entries, 470 to 9979
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Address           30 non-null     object
 1   Lot               30 non-null     object
 2   AM or PM          30 non-null     object
 3   Browser Info      30 non-null     object
 4   Company           30 non-null     object
 5   Credit Card       30 non-null     int64
 6   CC Exp Date       30 non-null     object
 7   CC Security Code  30 non-null     int64
 8   CC Provider       30 non-null     object
 9   Email             30 non-null     object
 10  Job               30 non-null     object
 11  IP Address        30 non-null     object
 12  Language          30 non-null     object
 13  Purchase Price    30 non-null     float64
dtypes: float64(1), int64(2), object(11)
memory usage: 3.5+ KB

### How many people made the purchase during the AM and how many people made the purchase during PM

In [81]:
ecom['AM or PM'].value_counts()

PM    5068
AM    4932
Name: AM or PM, dtype: int64

In [ ]:
What are the 3 most common Job Titles?

In [82]:
ecom['Job'].value_counts().head(3)

Interior and spatial designer    31
Lawyer                           30
Social researcher                28
Name: Job, dtype: int64

### Someone made a purchase that came from Lot: "90 WT" , what was the Purchase Price for this transaction?

In [83]:
ecom[ecom['Lot']=='90 WT']['Purchase Price']

513    75.1
Name: Purchase Price, dtype: float64

### How many people have Mastercard as their Credit Card Provider and made a purchase above $80 ?

In [84]:
ecom[(ecom['CC Provider']=='Mastercard') & (ecom['Purchase Price']>80)].count()

Address             175
Lot                 175
AM or PM            175
Browser Info        175
Company             175
Credit Card         175
CC Exp Date         175
CC Security Code    175
CC Provider         175
Email               175
Job                 175
IP Address          175
Language            175
Purchase Price      175
dtype: int64

### How many people have a credit card that expires in 2024?

In [86]:
ecom['CC Exp Date']

0       02/20
1       11/18
2       08/19
3       02/24
4       10/25
        ...
9995    03/22
9996    07/25
9997    05/21
9998    11/17
9999    02/19
Name: CC Exp Date, Length: 10000, dtype: object

In [91]:
ecom['CC Exp Date'].apply(lambda x: x[3:])=='24'

0       False
1       False
2       False
3        True
4       False
        ...
9995    False
9996    False
9997    False
9998    False
9999    False
Name: CC Exp Date, Length: 10000, dtype: bool

In [92]:
sum(ecom['CC Exp Date'].apply(lambda x: x[3:])=='24')

992

### What are the top 3 most popular email providers/hosts (e.g. gmail.com, yahoo.com, etc...)

In [100]:
ecom['Email'].apply(lambda x: x.split('@')[1]).value_counts().head(3)

hotmail.com    1638
yahoo.com      1616
gmail.com      1605
Name: Email, dtype: int64